Revit 2024 API
RebarShapeDefinition.Complete Property
 Report whether the shape definition is fully constrained.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2009
Syntax
C#
public bool Complete { get; }
Visual Basic
Public ReadOnly Property Complete As Boolean
	Get
Visual C++
public:
property bool Complete {
	bool get ();
}
See Also
RebarShapeDefinition Class
Autodesk.Revit.DB.Structure Namespace